#7.
#Рассчитайте скорость химической реакции A + B -> C 
#Входные данные: концентрация A - 3 моль/л концентрация B - 5 моль/л константа данной скорости реакции (k) - 997 с -1 
#Скорость реакции можно рассчитать с помощью следующего уравнения V = k * Ca * Cb
#Результат: 14955

A = 3
B = 5
k = 997
print(k * A * B)
